Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 256, 192, 3)]     0         
_________________________________________________________________
dropout (Dropout)            (None, 256, 192, 3)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 192, 8)       224       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 192, 8)       584       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 96, 8)        584       
_________________________________________________________________
batch_normalization (BatchNo (None, 128, 96, 8)        32        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 96, 16)       1168      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 48, 16)        2320      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 48, 16)        64        
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 48, 32)        4640      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 48, 32)        9248      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 24, 32)        9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 24, 32)        128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 24, 64)        18496     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 16, 12, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 12, 64)        256       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 12, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 6, 64)          36928     
_________________________________________________________________
flatten (Flatten)            (None, 3072)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               1573376   
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
code (Model)                 (None, 15)                495       
=================================================================
Total params: 1,801,439
Trainable params: 1,801,199
Non-trainable params: 240
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoder_input (InputLayer)   [(None, 15)]              0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                512       
_________________________________________________________________
dense_4 (Dense)              (None, 128)               4224      
_________________________________________________________________
dense_5 (Dense)              (None, 512)               66048     
_________________________________________________________________
dense_6 (Dense)              (None, 3072)              1575936   
_________________________________________________________________
reshape (Reshape)            (None, 8, 6, 64)          0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 16, 12, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 12, 64)        256       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 16, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 32, 24, 64)        36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 32, 24, 64)        256       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 24, 32)        18464     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 64, 48, 32)        9248      
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 64, 48, 32)        9248      
_________________________________________________________________
batch_normalization_6 (Batch (None, 64, 48, 32)        128       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 64, 48, 16)        4624      
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 128, 96, 16)       2320      
_________________________________________________________________
batch_normalization_7 (Batch (None, 128, 96, 16)       64        
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 128, 96, 8)        1160      
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 256, 192, 8)       584       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 256, 192, 8)       584       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 256, 192, 3)       219       
=================================================================
Total params: 1,804,659
Trainable params: 1,804,307
Non-trainable params: 352
_________________________________________________________________
Model: "second_criterion"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
second_criterion_input (Inpu [(None, 15)]              0         
_________________________________________________________________
dense (Dense)                (None, 24)                384       
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 200       
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 36        
=================================================================
Total params: 620
Trainable params: 620
Non-trainable params: 0
_________________________________________________________________
