Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 256, 8)       224       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 256, 8)       584       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 8)       584       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 16)      1168      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 16)      2320      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 16)        2320      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 32)        4640      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 32)        9248      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 64)        18496     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 16, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 64)        36928     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               2097664   
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
code (Model)                 (None, 10)                650       
=================================================================
Total params: 2,331,850
Trainable params: 2,331,850
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoder_input (InputLayer)   [(None, 10)]              0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                704       
_________________________________________________________________
dense_4 (Dense)              (None, 128)               8320      
_________________________________________________________________
dense_5 (Dense)              (None, 512)               66048     
_________________________________________________________________
dense_6 (Dense)              (None, 4096)              2101248   
_________________________________________________________________
reshape (Reshape)            (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 16, 16, 64)        36928     
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 16, 16, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 32, 32, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 32, 32)        18464     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 64, 64, 32)        9248      
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 64, 64, 32)        9248      
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 64, 64, 16)        4624      
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 128, 128, 16)      2320      
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 128, 128, 16)      2320      
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 128, 128, 8)       1160      
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 256, 256, 8)       584       
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 256, 256, 8)       584       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 256, 256, 3)       219       
=================================================================
Total params: 2,335,875
Trainable params: 2,335,875
Non-trainable params: 0
_________________________________________________________________
Model: "second_criterion"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
second_criterion_input (Inpu [(None, 10)]              0         
_________________________________________________________________
dense_7 (Dense)              (None, 24)                264       
_________________________________________________________________
dense_8 (Dense)              (None, 8)                 200       
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 36        
=================================================================
Total params: 500
Trainable params: 500
Non-trainable params: 0
_________________________________________________________________
